Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetBase Properties
The CurvedDimensionSetBase type exposes the following members.
Properties
Name | Description
ArcPoint1
 Gets the first arc point.
ArcPoint2
 Gets the second arc point.
ArcPoint3
 Gets the third arc point.
Attributes
 Gets or sets the dimension set attributes.
DimensionPoints
 Gets a list of the dimension points.
Distance
 Gets the distance. The distance is measured in paper millimeters.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from DimensionSetBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
CurvedDimensionSetBase Class
Tekla.Structures.Drawing Namespace